01  WS-AMOUNT PIC 9(5)V99 VALUE 0.
01  WS-AMOUNT-EXT PIC 9(7)V99 VALUE 0.

          Compute WS-AMOUNT-EXT = 12345.678
          MOVE WS-AMOUNT-EXT TO WS-AMOUNT
          DISPLAY WS-AMOUNT